# The pandas DataFrame Object

A DataFrame represents a rectangular table of data and contains an ordered collection of columns, each of which can be a different value type (numeric, string, boolean, etc.).

Creating a DataFrame from scratch

In [66]:
# create a DataFrame from a 2-d ndarray
import pandas as pd
import numpy as np
df = pd.DataFrame(np.array([[10,11,12,13],[20,21,22,23],[30,31,32,33]]))
df

# default row and columns indexes

    0   1   2   3
0  10  11  12  13
1  20  21  22  23
2  30  31  32  33

In [67]:
# create a DataFrame from a list of series objects
df1=pd.DataFrame([pd.Series(np.arange(10,15)),pd.Series(np.arange(15,20))])
df1

    0   1   2   3   4
0  10  11  12  13  14
1  15  16  17  18  19

In [68]:
# create a DataFrame with two Series objects and a dictionary
# because of dictionary data is coming in vertical form
s1=pd.Series(np.arange(1,6,1,))
s2=pd.Series(np.arange(6,11,1))
df2=pd.DataFrame({'boys':s1,'girls':s2})
df2

   boys  girls
0     1      6
1     2      7
2     3      8
3     4      9
4     5     10

In [69]:
df2a=pd.DataFrame([s1,s2])
df2a

   0  1  2  3   4
0  1  2  3  4   5
1  6  7  8  9  10

In [70]:
names=['Asad','Saad','Fahad','Ali']
ages=[23,34,23,21]
grades=['A','B','A','B']
data=pd.DataFrame({'Names':names,'Age':ages,'Grades':grades})
data

   Names  Age Grades
0   Asad   23      A
1   Saad   34      B
2  Fahad   23      A
3    Ali   21      B

In [71]:
names1={'Asad','Saad','Fahad','Ali'}
ages1={23,34,23,21}
grades1={'A','B','A','B'}
data1=pd.DataFrame([names,ages,grades])
data1

      0     1      2    3
0  Asad  Saad  Fahad  Ali
1    23    34     23   21
2     A     B      A    B

In [72]:
# specify column names
df3 = pd.DataFrame(np.array([[10, 11], [20, 21]]),columns=['apples', 'oranges'])
df3

   apples  oranges
0      10       11
1      20       21

In [73]:
#create a DataFrame with named columns and rows

df4 = pd.DataFrame(np.array([[10, 11, 12, 13], [20, 21, 22, 23]]), 
                   index=['apples', 'oranges'],
                   columns=['Mon', 'Tue','Wed', 'Thu'])
df4

         Mon  Tue  Wed  Thu
apples    10   11   12   13
oranges   20   21   22   23

In [74]:
# demonstrate alignment during creation
s3 = pd.Series(np.arange(12, 14), index=[1, 2])
df5 = pd.DataFrame({'c1': s1, 'c2': s2, 'c3': s3})
df5

   c1  c2    c3
0   1   6   NaN
1   2   7  12.0
2   3   8  13.0
3   4   9   NaN
4   5  10   NaN

In [75]:
# Examples of creating data frames
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year':  [2000, 2001, 2002, 2001, 2002, 2003],
        'pop':   [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

frame = pd.DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [76]:
pd.DataFrame(frame, columns=['year', 'state', 'pop']) # inplace nahi hoga

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [77]:
print(frame.year)
print(frame.state)

0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: year, dtype: int64
0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [78]:
frame['pop']

0    1.5
1    1.7
2    3.6
3    2.4
4    2.9
5    3.2
Name: pop, dtype: float64

In [79]:
# If you pass a column that isnâ€™t contained in the dict(debt), it will appear with missing values
# in the result:
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
                              index=['one', 'two', 'three', 'four','five', 'six'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [80]:
frame2.debt = 100
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   100
two    2001    Ohio  1.7   100
three  2002    Ohio  3.6   100
four   2001  Nevada  2.4   100
five   2002  Nevada  2.9   100
six    2003  Nevada  3.2   100

In [81]:
frame2['debt']=np.arange(6)
frame2

       year   state  pop  debt
one    2000    Ohio  1.5     0
two    2001    Ohio  1.7     1
three  2002    Ohio  3.6     2
four   2001  Nevada  2.4     3
five   2002  Nevada  2.9     4
six    2003  Nevada  3.2     5

In [82]:
val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])
frame2['debt'] = val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [83]:
#Adding more columns to dataframe
frame2['western']='abc'
frame2['eastern'] = frame2.state == 'Ohio'# true false
frame2

       year   state  pop  debt western  eastern
one    2000    Ohio  1.5   NaN     abc     True
two    2001    Ohio  1.7  -1.2     abc     True
three  2002    Ohio  3.6   NaN     abc     True
four   2001  Nevada  2.4  -1.5     abc    False
five   2002  Nevada  2.9  -1.7     abc    False
six    2003  Nevada  3.2   NaN     abc    False

In [84]:
frame2['greaterThan2']= frame2['pop'] > 2
frame2

       year   state  pop  debt western  eastern  greaterThan2
one    2000    Ohio  1.5   NaN     abc     True         False
two    2001    Ohio  1.7  -1.2     abc     True         False
three  2002    Ohio  3.6   NaN     abc     True          True
four   2001  Nevada  2.4  -1.5     abc    False          True
five   2002  Nevada  2.9  -1.7     abc    False          True
six    2003  Nevada  3.2   NaN     abc    False          True

In [85]:
del frame2['eastern']
frame2

       year   state  pop  debt western  greaterThan2
one    2000    Ohio  1.5   NaN     abc         False
two    2001    Ohio  1.7  -1.2     abc         False
three  2002    Ohio  3.6   NaN     abc          True
four   2001  Nevada  2.4  -1.5     abc          True
five   2002  Nevada  2.9  -1.7     abc          True
six    2003  Nevada  3.2   NaN     abc          True

In [86]:
del frame2['wester']

KeyError: 'wester'

In [87]:
pd.DataFrame(frame2,columns=['year','state','pop','debt','western','greaterThan2'])

       year   state  pop  debt western  greaterThan2
one    2000    Ohio  1.5   NaN     abc         False
two    2001    Ohio  1.7  -1.2     abc         False
three  2002    Ohio  3.6   NaN     abc          True
four   2001  Nevada  2.4  -1.5     abc          True
five   2002  Nevada  2.9  -1.7     abc          True
six    2003  Nevada  3.2   NaN     abc          True

In [88]:
data = {'name':["Asad","Saad","Fahad", 'Ali'], 
        'age':[23,34,23,21], 
        'AiforEveryONe':[89,78,90,98],
        'python':[78,89,87,89],
        'git': [90,98,87,86],
        'numpy':[98,87,98,99]       }
        
data = pd.DataFrame(data)
data

    name  age  AiforEveryONe  python  git  numpy
0   Asad   23             89      78   90     98
1   Saad   34             78      89   98     87
2  Fahad   23             90      87   87     98
3    Ali   21             98      89   86     99

In [89]:
# data['Total'] = data['AiforEveryONe']+data['python']+data['git']+data['numpy']
# we can also use the following
data['Total'] = data[['AiforEveryONe','python','git','numpy']].sum(axis=1)
data['percent'] = data['Total']/400*100
# data['grade']=if(data['percent']>90):return 'A+'
data

    name  age  AiforEveryONe  python  git  numpy  Total  percent
0   Asad   23             89      78   90     98    355    88.75
1   Saad   34             78      89   98     87    352    88.00
2  Fahad   23             90      87   87     98    362    90.50
3    Ali   21             98      89   86     99    372    93.00

In [90]:
#Another common form of data is a nested dict of dicts:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
       
       'Ohio':   {2000: 1.5, 2001: 1.7, 2002: 3.6}}
df3 =pd.DataFrame(pop)
df3
# If the nested dict is passed to the DataFrame, pandas will interpret the 
# outer dict keys as the columns and the inner keys as the row indice

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [91]:
# Transpose DataFrame
df3.T

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

In [92]:
df3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [93]:
pop1 =pd.DataFrame(pop, index=[2001, 2002, 2003])
pop1

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [94]:
#slicing
pdata = {'Ohio': df3['Ohio'][:-1],
        'Nevada': df3['Nevada'][:2]
        }
pd.DataFrame(pdata)

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9

In [95]:
# labelling of index and columns
df3.index.name = 'year'
df3.columns.name = 'state'
df3

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

# Index Objects

pandasâ€™s Index objects are responsible for holding the axis labels and other metadata (like the axis name or names). Any array or other sequence of labels you use when constructing a Series or DataFrame is internally converted to an Index:

In [96]:
obj = pd.Series(range(3), index=['a', 'b', 'c'])
print(obj)
index =obj.index
print(index)

a    0
b    1
c    2
dtype: int64
Index(['a', 'b', 'c'], dtype='object')

In [97]:
# Slicing of index
index[1:]

Index(['b', 'c'], dtype='object')

In [98]:
index[1] = 'd'  # indices are immutable

TypeError: Index does not support mutable operations

In [99]:
labels = pd.Index(["a","b","c","d","e","f"])
labels
# creating an ndarray that is immutable
# coz created via Index function and index are immutable

Index(['a', 'b', 'c', 'd', 'e', 'f'], dtype='object')

In [100]:
labels[0]="z" #immutable

TypeError: Index does not support mutable operations

In [ ]:
frame

In [ ]:
frame.index=labels
frame

In [ ]:
print(frame.index)   # is index type object - immutable
print(frame.columns)  # is also inde type object - immutable

# Essential Functionality

In [ ]:
frame2['debt']=np.arange(6)
print("The frame is", end="\n\n")
print(frame2,end="\n\n")
print("The row indices are", end="\n")
print(frame2.index,end="\n\n")
print("The col indeces are",end="\n")
print(frame2.columns)

In [ ]:
###### by default: row are reindexed via reindex function#####
reindex_frame = frame2.reindex(['five','two', 'three', 'six', 'four','one','seven'])
reindex_frame

In [ ]:
# The columns can be reindexed with the columns keyword:
reindex_frame = frame2.reindex(columns=['pop','year','imports', 'debt', 'state',"exports" ])
reindex_frame

# Dropping Entries from an Axis

In [ ]:
reindex_frame.drop(['three','six'])

In [ ]:
reindex_frame.drop(['imports','exports'],axis=1)

# Another Example

In [ ]:
index = ['Firefox', 'Chrome', 'Safari', 'IE10', 'Konqueror']
df = pd.DataFrame({'http_status': [200,200,404,404,301],
                   'response_time': [0.04, 0.02, 0.07, 0.08, 1.0]},index=index)
df

Create a new index and reindex the dataframe. By default values in the new index that do not have corresponding records in the dataframe are assigned NaN.

In [ ]:
new_index= ['Safari', 'Iceweasel', 'Comodo Dragon', 'IE10','Chrome']
df.reindex(new_index)

We can fill in the missing values by passing a value to the keyword fill_value. Because the index is not monotonically increasing or decreasing, we cannot use arguments to the keyword method to fill the NaN values.

In [ ]:
df.reindex(new_index, fill_value=0)

In [ ]:
df.reindex(new_index,fill_value='missing info')

In [ ]:
#We can also reindex the columns.
df.reindex(columns=['http_status', 'user_agent'])

In [ ]:
# Or we can use "axis-style" keyword arguments
df.reindex(['http_status', 'user_agent'], axis="columns",fill_value="missing info")

To further illustrate the filling functionality in reindex, we will create a dataframe with a monotonically increasing index (for example, a sequence of dates)

In [ ]:
date_index = pd.date_range('1/1/2010', periods=6, freq='D')
df2 = pd.DataFrame({"prices": [100, 101, np.nan, 100, 89, 88]},index=date_index)
df2

In [ ]:
# Suppose we decide to expand the dataframe to cover a wider date range.
date_index2 = pd.date_range('12/29/2009', periods=10, freq='D')
df2.reindex(date_index2)

The index entries that did not have a value in the original data frame (for example, '2009-12-29') are by default filled with NaN. If desired, we can fill in the missing values using one of several options.
For example, to back-propagate the last valid value to fill the NaN values, pass bfill as an argument to the method keyword.

In [ ]:
df2.reindex(date_index2, method='bfill')

Please note that the NaN value present in the original dataframe (at index value 2010-01-03) will not be filled by any of the value propagation schemes. This is because 
filling while reindexing does not look at dataframe values, but only compares the original and desired indexes. If you do want to fill in the NaN values present in the original dataframe, use the fillna() method.

# Indexing, Selection, and Filtering

In [101]:
data = pd.DataFrame(np.arange(40).reshape((10, 4)),
    index=['Ohio', 'Colorado', 'Washington','Nebraska','Utah', 'New York','California', 'Texas', 'Georgia', 'Alaska'],
    columns=['Jan', 'Feb', 'Mar', 'Apr'])
data

            Jan  Feb  Mar  Apr
Ohio          0    1    2    3
Colorado      4    5    6    7
Washington    8    9   10   11
Nebraska     12   13   14   15
Utah         16   17   18   19
New York     20   21   22   23
California   24   25   26   27
Texas        28   29   30   31
Georgia      32   33   34   35
Alaska       36   37   38   39

In [102]:
# getting a single col
data['Jan']

Ohio           0
Colorado       4
Washington     8
Nebraska      12
Utah          16
New York      20
California    24
Texas         28
Georgia       32
Alaska        36
Name: Jan, dtype: int64

In [103]:
#getting multiple cols
data[['Jan', 'Apr']]

            Jan  Apr
Ohio          0    3
Colorado      4    7
Washington    8   11
Nebraska     12   15
Utah         16   19
New York     20   23
California   24   27
Texas        28   31
Georgia      32   35
Alaska       36   39

In [104]:
#integer based 
data[:2]  #slicing rows starts from 0 & take two rows

          Jan  Feb  Mar  Apr
Ohio        0    1    2    3
Colorado    4    5    6    7

In [105]:
#label based
data["Utah":"Texas"]  #slicing rows starts from "Utah" & goto "Texas"

            Jan  Feb  Mar  Apr
Utah         16   17   18   19
New York     20   21   22   23
California   24   25   26   27
Texas        28   29   30   31

In [106]:
data[2:6,0:2]   # Slicing Subsets of Rows and Columns either by label index 
                # or by integer indexing is not possible, we have some other sol

TypeError: '(slice(2, 6, None), slice(0, 2, None))' is an invalid key

In [107]:
data["Utah":"Texas", "Jan":'Mar']    # Slicing Subsets of Rows and Columns either by label index 
                                 # or by integer indexing isnot possible, we have some other sol

TypeError: '(slice('Utah', 'Texas', None), slice('Jan', 'Mar', None))' is an invalid key

In [110]:
# use if loc (label based)
data.loc["Utah":"Texas", "Jan":'Mar']

            Jan  Feb  Mar
Utah         16   17   18
New York     20   21   22
California   24   25   26
Texas        28   29   30

In [111]:
#use if iloc (integer based)
data.iloc[2:6,0:2]

            Jan  Feb
Washington    8    9
Nebraska     12   13
Utah         16   17
New York     20   21

In [112]:
a = pd.DataFrame({"p":[2,4,6]})
a.rdiv(2)   # 2/6

          p
0  1.000000
1  0.500000
2  0.333333

In [113]:
# select all the data from the month of march that have value greater than 15
data['Mar'] > 15

Ohio          False
Colorado      False
Washington    False
Nebraska      False
Utah           True
New York       True
California     True
Texas          True
Georgia        True
Alaska         True
Name: Mar, dtype: bool

In [114]:
data[data['Mar'] > 20]

            Jan  Feb  Mar  Apr
New York     20   21   22   23
California   24   25   26   27
Texas        28   29   30   31
Georgia      32   33   34   35
Alaska       36   37   38   39

In [115]:
data[data[['Mar','Feb']]>20

SyntaxError: unexpected EOF while parsing (<ipython-input-115-2516430eb354>, line 1)

In [116]:
data[data < 5] = 0
data

            Jan  Feb  Mar  Apr
Ohio          0    0    0    0
Colorado      0    5    6    7
Washington    8    9   10   11
Nebraska     12   13   14   15
Utah         16   17   18   19
New York     20   21   22   23
California   24   25   26   27
Texas        28   29   30   31
Georgia      32   33   34   35
Alaska       36   37   38   39

# Function Application and Mapping

In [117]:
frame = np.abs(pd.DataFrame(np.random.randn(4, 3),columns=list('bde'),
                            index=['Utah', 'Ohio', 'Texas', 'Oregon']))
frame

               b         d         e
Utah    0.312379  0.043176  0.842700
Ohio    0.211063  0.830140  0.581390
Texas   1.077429  0.218595  1.467968
Oregon  0.935345  0.214504  1.182875

In [118]:
f = lambda x: x.max() - x.min()  # subtract the min value of each col from max of each col/

In [119]:
frame.apply(f,axis='rows')  # row or 0 for each row wise

b    0.866366
d    0.786965
e    0.886578
dtype: float64

In [120]:
frame.apply(f,axis='columns')  # columns or 1 for each col wise

Utah      0.799525
Ohio      0.619078
Texas     1.249373
Oregon    0.968371
dtype: float64

In [121]:
(lambda x: x*x*x)(10)

1000

# Application of Lambda Functions with Different Functions

In [122]:
df=pd.DataFrame({
                'id':[1,2,3,4,5],
                'name':['Asad','Saad','Numi','Roman','Maria'],
                'age':[20,25,15,10,30],
                'income':[4000,7000,200,0,10000]})
df

   id   name  age  income
0   1   Asad   20    4000
1   2   Saad   25    7000
2   3   Numi   15     200
3   4  Roman   10       0
4   5  Maria   30   10000

In [123]:
df['age']=[age+3 for age in df['age']]
df

   id   name  age  income
0   1   Asad   23    4000
1   2   Saad   28    7000
2   3   Numi   18     200
3   4  Roman   13       0
4   5  Maria   33   10000

In [124]:
df['age']=df['age']+3
df

   id   name  age  income
0   1   Asad   26    4000
1   2   Saad   31    7000
2   3   Numi   21     200
3   4  Roman   16       0
4   5  Maria   36   10000

# Application of Lambda with Apply

Letâ€™s say we have got an error in the age variable. We recorded ages with a difference of 3 years. So, to remove this error from the Pandas dataframe, we have to add three years to every personâ€™s age. We can do this with the apply() function in Pandas.

apply() function in Pandas calls the lambda function and applies it to every row or column of the dataframe and returns a modified copy of the dataframe:

In [125]:
df['age']=df.apply(lambda x: x['age']+3,axis='columns')  # on frame
df

   id   name  age  income
0   1   Asad   29    4000
1   2   Saad   34    7000
2   3   Numi   24     200
3   4  Roman   19       0
4   5  Maria   39   10000

In [126]:
df['age']=df['age'].apply(lambda x: x+3) #on particular series
df

   id   name  age  income
0   1   Asad   32    4000
1   2   Saad   37    7000
2   3   Numi   27     200
3   4  Roman   22       0
4   5  Maria   42   10000

In [127]:
df['income']=df['income'].apply(lambda x:x*1.5)
df

   id   name  age   income
0   1   Asad   32   6000.0
1   2   Saad   37  10500.0
2   3   Numi   27    300.0
3   4  Roman   22      0.0
4   5  Maria   42  15000.0

# Application of Lambda with Filter

Now, letâ€™s see how many of these people are above the age of 18.
We can do this using the filter() function.
The filter() function takes a lambda function and a Pandas series and applies the lambda function on the series and filters the data.

In [128]:
list(filter(lambda x: x>18, df['age']))

[32, 37, 27, 22, 42]

In [129]:
x=df[(lambda x:x>18)(df['age'])]
x

   id   name  age   income
0   1   Asad   32   6000.0
1   2   Saad   37  10500.0
2   3   Numi   27    300.0
3   4  Roman   22      0.0
4   5  Maria   42  15000.0

# Application of Lambda with Map

Youâ€™ll be able to relate to the next statement. ðŸ™‚ Itâ€™s performance appraisal time and the income of all the employees gets increased by 20%. This means we have to increase the salary of each person by 20% in our Pandas dataframe.

We can do this using the map() function. This map() function maps the series according to input correspondence. It is very helpful when we have to substitute a series with other values.

In [130]:
df['income']=list(map(lambda x: int(x+x*0.2),df['income']))
df

   id   name  age  income
0   1   Asad   32    7200
1   2   Saad   37   12600
2   3   Numi   27     360
3   4  Roman   22       0
4   5  Maria   42   18000

In [131]:
df['income2'] = df['income'].apply(lambda x: x+x*.2)
df

   id   name  age  income  income2
0   1   Asad   32    7200   8640.0
1   2   Saad   37   12600  15120.0
2   3   Numi   27     360    432.0
3   4  Roman   22       0      0.0
4   5  Maria   42   18000  21600.0

# Conditional Statements using Lambda FunctionsÂ¶

Lambda functions also support conditional statements, such as if..else. This makes lambda functions very powerful.

Letâ€™s say in the family dataframe we have to categorize people into â€˜Adultâ€™ or â€˜Childâ€™. For this, we can simply apply the lambda function to our dataframe:

In [132]:
df['category']=df['age'].apply(lambda x: 'Adult' if x>=18 else 'Child')
df

   id   name  age  income  income2 category
0   1   Asad   32    7200   8640.0    Adult
1   2   Saad   37   12600  15120.0    Adult
2   3   Numi   27     360    432.0    Adult
3   4  Roman   22       0      0.0    Adult
4   5  Maria   42   18000  21600.0    Adult

# Lambda with ReduceÂ¶

Now, letâ€™s see the total income of the family. To calculate this, we can use the reduce() function in Python. It is used to apply a particular function to the list of elements in the sequence. The reduce() function is defined in the â€˜functoolsâ€™ module.

For using the reduce() function, we have to import the functools module first:

In [133]:
import functools
functools.reduce(lambda a,b: a+b,df['income'])

38160

# Summarizing and Computing Descriptive StatisticsÂ¶

In [134]:
#do your self

# Correlation and CovarianceÂ¶

09-Correlation and Covariance

# Data Loading, Storage and File Formats

See the separate files for the above topic

- 05_Data Loading
- 06_Inspecting Data
- 07_Data Saving and Serialising

Read above topic from the book also

# JSON Data

see 06_Json

# Interacting with Web APIs

see 07_Interacting with Web APIs

# Interacting with Database

see 08_Interacting with Darabase